module.exports = {
    error: {
        accountAlreadyActive: 'Обліковий запис користувача вже активовано',
        incorrectRegisterLink: 'Доступ заборонено. Неправильне реєстраційне посилання. Використовуйте функцію відновлення пароля',
        incorrectLinkNotFound: 'Неправильне реєстраційне посилання. Користувача не знайдено',
        incorrectSessionToken: 'Недійсний токен сеансу. Перевторити авторизацію',
        incorrectTokenData: 'Недійсні дані токена',
        linkExpired: 'Посилання минуло. Використовуйте функцію відновлення пароля',
        resourceForbidden: 'Доступ до цього ресурсу заборонено!',
        sessionExpired: 'Сеанс закінчився. Перевторити авторизацію',
        userEmailExists: 'Користувач з цим електронним листом існує',
        userNotFound: 'Користувач не найден',
        userAlreadyRegister: 'Користувач вже зареєстрований',
        userNotAuthenticated: 'Для доступу до цього ресурсу потрібна авторизація',
        onlyNotAuthUsers: 'Ресурс доступний лише для нових відвідувачів',
    },
    success: {
        accountActivated: 'Користувач успішно активований',
        accountUpdated: 'Користувач успішно оновлений',
        accountRemoved: 'Користувач успішно видалений',
        sentEmailInvite: 'Запрошення успішно надіслано на електронну пошту користувача',
        sentPassRecoveryInviteLink: 'Посилання відновлення пароля успішно надіслано на вашу електронну пошту',
        passwordRestored: 'Пароль успішно відновлено. Для авторизації використовуйте електронну пошту та новий пароль'
    }
}