module.exports = {
    error: {
        accountAlreadyActive: 'Обліковий запис користувача вже активовано',
        accountNotActive: 'Аккаунт не підтверджений. Потрібно завершити реєстрацію!',
        incorrectRegisterLink: 'Доступ заборонено. Неправильне реєстраційне посилання. Використовуйте функцію відновлення пароля',
        incorrectLinkNotFound: 'Неправильне реєстраційне посилання. Користувача не знайдено',
        incorrectSessionToken: 'Недійсний токен сеансу. Перевторити авторизацію',
        incorrectTokenData: 'Недійсні дані токена',
        linkExpired: 'Посилання минуло. Використовуйте функцію відновлення пароля',
        resourceForbidden: 'Доступ до цього ресурсу заборонено!',
        sessionExpired: 'Сеанс закінчився. Перевторити авторизацію',
        userEmailExists: 'Користувач з такою адресою пошти вже існує',
        userNotFound: 'Користувач не найден',
        userAlreadyRegister: 'Користувач вже зареєстрований',
        userNotAuthenticated: 'Для доступу до цього ресурсу потрібна авторизація',
        onlyNotAuthUsers: 'Ресурс доступний лише для нових відвідувачів',
        incorrectCredentials: 'Не правильний логін або пароль'
    },
    success: {
        accountActivated: 'Користувач успішно активований',
        accountUpdated: 'Користувач успішно оновлений',
        accountRemoved: 'Користувач успішно видалений',
        sentEmailInvite: 'Запрошення успішно надіслано на електронну пошту користувача',
        sentPassRecoveryInviteLink: 'Посилання відновлення пароля успішно надіслано на вашу електронну пошту',
        passwordRestored: 'Пароль успішно відновлено. Для авторизації використовуйте електронну пошту та новий пароль'
    },
    validate: {
        // email
        emailRegexp: 'Некоректний формат ел. пошти',
        emailRequired: 'Необхідно вказати email користувача',

        // secret
        secretMinLength: 'Довжина пароля повинна бути не менше 6 символів',
        secretMaxLength: 'Довжина пароля повинна бути не більше 14 символів',
        secretRegexp: 'Пароль повинен довжиною від 6 до 14 символів і містити хоча б 1 цифру, 1 заголовну і 1 малу літери латинського алфавіту!',
        secretRequired: 'Необхідно вказати пароль користувача',

        // token
        tokenMinLength: 'Некоректний формат токена',
        tokenRequired: 'Токен обов\'язковий до передачі',

        //firstname
        firstNameMinLength: 'Довжина імені повинна бути не менше 4 символів',
        firstNameMaxLength: 'Довжина імені повинна бути не більше 20 символів',
        firstNameRegexp: 'Ім\'я може складатися тільки з кириличних літер (Укр / Рус)',
        firstNameRequired: 'Необхідно вказати ім\'я користувача',

        // lastname
        lastNameMinLength: 'Довжина прізвища повинна бути не менше 4 символів',
        lastNameMaxLength: 'Довжина прізвища повинна бути не більше 20 символів',
        lastNameRegexp: 'Прізвище може складатися тільки з кириличних літер (Укр / Рус)',
        lastNameRequired: 'Необхідно вказати прізвище користувача',

        // sex
        sexEnum: 'Потрібно вибрати коректне значення поля "Стать"',
        sexRequired: 'Необхідно вибрати стать користувача',

        // phone number
        phoneNumberRegexp: 'Некоректний формат номера телефону',
        phoneNumberRequired: 'Необхідно вказати номер телефону користувача',
        birthdayFormat: 'Некоректний формат дати народження',
    },
    email: {
        recipient: 'Користувач',
        subjects: {
            registerConfirm: 'Share CV | Підтвердження email',
		    registerComplete: 'Share CV | Аккаунт успішно активовано',
		    passwordRestore: 'Share CV | Відновлення паролю',
		    passwordRestoreComplete: 'Share CV | Пароль успішно відновлено'
        },
        register: {
            greetings: 'Ласкаво просимо!',
            headerText: 'Дякуємо за реєстрацію і сподіваємося, що наш сервіс допоможе вам досягти поставленої мети :)',
            bodyContent: 'Для завершення реєстрації та активації облікового запису, перейдіть за посиланням.',
            bodyWarning: 'Зверніть увагу!',
            bodyLinkExpiresText: 'Посилання дійсне протягом 24 годин!',
            buttonText: 'Підтвердити email'
        },
        activated: {
            greetings: 'Вітаємо,',
            headerText: 'Ваш аккаунт успішно активовано.',
            bodyContent: 'Для доступу в адмінпанель сервісу використовуйте ваш email та пароль.',
            bodyLoginLink: 'Сторінка авторизації доступна по посиланню нижче',
            buttonText: 'Перехід в адмінпанель'
        },
        passRecovery: {
            greetings: 'Вітаємо,',
            headerText: 'Ми отримали запит на відновлення пароля до вашого аккаунту.',
            bodyContent: 'Для відновлення пароля і реактивації аккаунта, перейдіть за посиланням.',
            bodyWarning: 'Зверніть увагу!',
            bodyLinkExpiresText: 'Посилання дійсне протягом 24 годин!',
            buttonText: 'Відновити пароль'
        },
        passRecoveryComplete: {
            greetings: 'Вітаємо,',
            headerText: 'Пароль успішно відновлено, аккаунт активований.',
            bodyContent: 'Можете пройти авторизацію використовуючи ваш email та новий пароль.',
            bodyLoginLink: 'Сторінка авторизації доступна по посиланню нижче',
            buttonText: 'Перехід в адмінпанель'
        }
    }
}